package com.foya.noms.enums;


/**
 * 
 * 
 * <table>
 * <tr>
 * <th>版本</th>
 * <th>日期</th>
 * <th>詳細說明</th>
 * <th>modifier</th>
 * </tr>
 * <tr>
 * <td>1.0</td>
 * <td>2015/2/3</td>
 * <td>各模組PDF文件對應代碼</td>
 * <td>Charlie Woo</td>
 * </tr>
 * </table> 
 *
 * @author Charlie Woo
 *
 */
public enum PrintPdfDoc {
	
	LSF01,	/** 行動通信業務設備設置契約-自然人版(極機密) **/
	LSF02,	/** Repeater新約_Repeater有償租約 **/
	LSF03,	/** Repeater新約_Repeater無償租約 **/
	LSF04,	/** Repeater新約(個人用)_10mW及20mW Repeater 無償同意書 **/
	LSF05,	/** Repeater新約_3G4G室內訊號改善設備設置暨保管同意書_直營門市 **/
	LSF06,	/** 用印簽辦單 **/
	LSF07,	/** 租金起付確認書-無押金 **/
	LSF08,	/** 租(押)金起付確認書-有押金+假扣押 **/
	LSF09,	/** 委託管理使用收益暨授權簽約書 **/
	LSF10,	/** 手機簽收確認書 **/
	LSF11,	/** 借電_3G+4G借電協議書-(首次) **/
	LSF12,	/** NodeB新約_請電同意書 **/
	LSF13,	/** 借電_借電期前終止協議書 **/
	LSF14,	/** 借電_借電補充協議書-(一般) **/
	LSF15,	/** 借電_借電補充協議書-(調為實報實銷) **/
	LSF16,	/** 續約同意書 **/
	LSF17,	/** 補充協議書－基站續約期限變更 **/
	LSF18,	/** 解約_期前終止協議書 **/
	LSF19,	/** 解約_期前終止協議書_for 3G 室內訊號改善同意書 **/
	LSF20,	/** 降租_暫停支付同意書 **/
	LSF21,	/** 降租_調降租金同意書 **/
	LSF22,	/** 補充協議書-3G設備租金調漲加註台灣之星 **/
	LSF23,	/** 補充協議書-租約由管理費變更租金 **/
	LSF24,	/** 補充協議書－加裝4G設備不調漲租金 **/
	LSF25,	/** 補充協議書－加裝4G設備且租金調漲 **/
	LSF26,	/** 補充協議書-加裝4G設備-調漲租金及電費 **/
	LSF27,	/** 補充協議書-加裝4G設備不調漲租金但調電費 **/
	LSF28,	/** 繼受出租人地位聲明書 **/
	LSF29,	/** 變更出租人公司負責人及匯款帳號協議書 **/
	LSF30,	/** 變更出租人名義協議書 **/
	LSF31,	/** 出租人更名-印鑑及匯款帳號變更切結書 **/
	LSF32,	/** 變更印鑑切結書 **/
	LSF33,	/** 出租人聲明書-同意租金抵扣代繳所得稅 **/
	LSF34,	/** 變更電滙帳戶切結書 **/
	LSF35,	/** 變更電滙帳戶切結書 (有押金) **/
	
	;

	
}
